; domain
;; Enrico Scala (enricos83@gmail.com)
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; counters-ineq-rnd domain, functional strips version
;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;;
;;; This domain describes a set of counters that can be increased and decreased. The rate of such counter is however variable!

(define (domain fo-counters-rnd)
    (:requirements :strips :typing :fluents :adl)
    (:types counter)

    (:functions
        (value ?c - counter);; - int  ;; The value shown in counter ?c
        (rate_value ?c - counter);;
        (max_int);; -  int ;; The maximum integer we consider - a static value
    )

    ;; Increment the value in the given counter by one
    (:action increment
         :parameters (?c - counter)
         :precondition (and (<= (+ (value ?c) (rate_value ?c)) (max_int)))
         :effect (and (increase (value ?c) (rate_value ?c)))
    )
    ;; Decrement the value in the given counter by one
    (:action decrement
         :parameters (?c - counter)
         :precondition (and (>= (- (value ?c) (rate_value ?c)) 0))
         :effect (and (decrease (value ?c) (rate_value ?c)))
    )

    (:action increase_rate
         :parameters (?c - counter)
         :precondition (and (<= (+ (rate_value ?c) 1) 10))
         :effect (and (increase (rate_value ?c) 1))
    )

    (:action decrement_rate
         :parameters (?c - counter)
         :precondition (and (>= (rate_value ?c) 1))
         :effect (and (decrease (rate_value ?c) 1))
    )


)

; problem
;; Enrico Scala (enricos83@gmail.com) and Miquel Ramirez (miquel.ramirez@gmail.com)
(define (problem instance_19_100)
	(:domain fo-counters-rnd)
	(:objects
		c0 c1 c2 c3 c4 c5 c6 c7 c8 c9 c10 c11 c12 c13 c14 c15 c16 c17 c18 - counter
	)
  (:init
		(= (value c0) 0)
	(= (value c1) 5)
	(= (value c2) 43)
	(= (value c3) 49)
	(= (value c4) 2)
	(= (value c5) 8)
	(= (value c6) 60)
	(= (value c7) 1)
	(= (value c8) 96)
	(= (value c9) 72)
	(= (value c10) 61)
	(= (value c11) 23)
	(= (value c12) 19)
	(= (value c13) 34)
	(= (value c14) 86)
	(= (value c15) 34)
	(= (value c16) 75)
	(= (value c17) 23)
	(= (value c18) 57)

        (= (rate_value c0) 0)
	(= (rate_value c1) 0)
	(= (rate_value c2) 0)
	(= (rate_value c3) 0)
	(= (rate_value c4) 0)
	(= (rate_value c5) 0)
	(= (rate_value c6) 0)
	(= (rate_value c7) 0)
	(= (rate_value c8) 0)
	(= (rate_value c9) 0)
	(= (rate_value c10) 0)
	(= (rate_value c11) 0)
	(= (rate_value c12) 0)
	(= (rate_value c13) 0)
	(= (rate_value c14) 0)
	(= (rate_value c15) 0)
	(= (rate_value c16) 0)
	(= (rate_value c17) 0)
	(= (rate_value c18) 0)

		(= (max_int) 100)
	)
	(:goal
		(and
			(<= (+ (value c0) 1) (value c1))
	(<= (+ (value c1) 1) (value c2))
	(<= (+ (value c2) 1) (value c3))
	(<= (+ (value c3) 1) (value c4))
	(<= (+ (value c4) 1) (value c5))
	(<= (+ (value c5) 1) (value c6))
	(<= (+ (value c6) 1) (value c7))
	(<= (+ (value c7) 1) (value c8))
	(<= (+ (value c8) 1) (value c9))
	(<= (+ (value c9) 1) (value c10))
	(<= (+ (value c10) 1) (value c11))
	(<= (+ (value c11) 1) (value c12))
	(<= (+ (value c12) 1) (value c13))
	(<= (+ (value c13) 1) (value c14))
	(<= (+ (value c14) 1) (value c15))
	(<= (+ (value c15) 1) (value c16))
	(<= (+ (value c16) 1) (value c17))
	(<= (+ (value c17) 1) (value c18))
		)
	)
)

; plan
1. (increase_rate c17)
   changed: (rate_value c17) from 0 to 1
   goals met: 10 of 18
2. (increase_rate c17)
   changed: (rate_value c17) from 1 to 2
   goals met: 10 of 18
3. (increase_rate c17)
   changed: (rate_value c17) from 2 to 3
   goals met: 10 of 18
4. (increase_rate c17)
   changed: (rate_value c17) from 3 to 4
   goals met: 10 of 18
5. (increase_rate c17)
   changed: (rate_value c17) from 4 to 5
   goals met: 10 of 18
6. (increase_rate c17)
   changed: (rate_value c17) from 5 to 6
   goals met: 10 of 18
7. (increase_rate c15)
   changed: (rate_value c15) from 0 to 1
   goals met: 10 of 18
8. (increase_rate c15)
   changed: (rate_value c15) from 1 to 2
   goals met: 10 of 18
9. (increase_rate c15)
   changed: (rate_value c15) from 2 to 3
   goals met: 10 of 18
10. (increase_rate c15)
   changed: (rate_value c15) from 3 to 4
   goals met: 10 of 18
11. (increase_rate c15)
   changed: (rate_value c15) from 4 to 5
   goals met: 10 of 18
12. (increase_rate c15)
   changed: (rate_value c15) from 5 to 6
   goals met: 10 of 18
13. (increase_rate c12)
   changed: (rate_value c12) from 0 to 1
   goals met: 10 of 18
14. (increase_rate c12)
   changed: (rate_value c12) from 1 to 2
   goals met: 10 of 18
15. (increase_rate c12)
   changed: (rate_value c12) from 2 to 3
   goals met: 10 of 18
16. (increment c12)
   changed: (value c12) from 19 to 22
   goals met: 10 of 18
17. (increment c12)
   changed: (value c12) from 22 to 25
   goals met: 11 of 18
18. (increase_rate c11)
   changed: (rate_value c11) from 0 to 1
   goals met: 11 of 18
19. (increase_rate c11)
   changed: (rate_value c11) from 1 to 2
   goals met: 11 of 18
20. (increase_rate c11)
   changed: (rate_value c11) from 2 to 3
   goals met: 11 of 18
21. (increase_rate c11)
   changed: (rate_value c11) from 3 to 4
   goals met: 11 of 18
22. (increase_rate c11)
   changed: (rate_value c11) from 4 to 5
   goals met: 11 of 18
23. (increase_rate c11)
   changed: (rate_value c11) from 5 to 6
   goals met: 11 of 18
24. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 11 of 18
25. (increase_rate c8)
   changed: (rate_value c8) from 0 to 1
   goals met: 11 of 18
26. (increase_rate c8)
   changed: (rate_value c8) from 1 to 2
   goals met: 11 of 18
27. (increase_rate c8)
   changed: (rate_value c8) from 2 to 3
   goals met: 11 of 18
28. (decrement_rate c9)
   changed: (rate_value c9) from 1 to 0
   goals met: 11 of 18
29. (increase_rate c7)
   changed: (rate_value c7) from 0 to 1
   goals met: 11 of 18
30. (increase_rate c6)
   changed: (rate_value c6) from 0 to 1
   goals met: 11 of 18
31. (increase_rate c7)
   changed: (rate_value c7) from 1 to 2
   goals met: 11 of 18
32. (increase_rate c7)
   changed: (rate_value c7) from 2 to 3
   goals met: 11 of 18
33. (increase_rate c7)
   changed: (rate_value c7) from 3 to 4
   goals met: 11 of 18
34. (increase_rate c7)
   changed: (rate_value c7) from 4 to 5
   goals met: 11 of 18
35. (increase_rate c7)
   changed: (rate_value c7) from 5 to 6
   goals met: 11 of 18
36. (increase_rate c6)
   changed: (rate_value c6) from 1 to 2
   goals met: 11 of 18
37. (increase_rate c6)
   changed: (rate_value c6) from 2 to 3
   goals met: 11 of 18
38. (increase_rate c6)
   changed: (rate_value c6) from 3 to 4
   goals met: 11 of 18
39. (increase_rate c7)
   changed: (rate_value c7) from 6 to 7
   goals met: 11 of 18
40. (increase_rate c7)
   changed: (rate_value c7) from 7 to 8
   goals met: 11 of 18
41. (increase_rate c17)
   changed: (rate_value c17) from 6 to 7
   goals met: 11 of 18
42. (increase_rate c17)
   changed: (rate_value c17) from 7 to 8
   goals met: 11 of 18
43. (increment c17)
   changed: (value c17) from 23 to 31
   goals met: 11 of 18
44. (increment c17)
   changed: (value c17) from 31 to 39
   goals met: 11 of 18
45. (increment c17)
   changed: (value c17) from 39 to 47
   goals met: 11 of 18
46. (increase_rate c17)
   changed: (rate_value c17) from 8 to 9
   goals met: 11 of 18
47. (increment c17)
   changed: (value c17) from 47 to 56
   goals met: 11 of 18
48. (increase_rate c17)
   changed: (rate_value c17) from 9 to 10
   goals met: 11 of 18
49. (increment c17)
   changed: (value c17) from 56 to 66
   goals met: 10 of 18
50. (increase_rate c15)
   changed: (rate_value c15) from 6 to 7
   goals met: 10 of 18
51. (increase_rate c15)
   changed: (rate_value c15) from 7 to 8
   goals met: 10 of 18
52. (increment c15)
   changed: (value c15) from 34 to 42
   goals met: 10 of 18
53. (increment c15)
   changed: (value c15) from 42 to 50
   goals met: 10 of 18
54. (increment c15)
   changed: (value c15) from 50 to 58
   goals met: 10 of 18
55. (increase_rate c15)
   changed: (rate_value c15) from 8 to 9
   goals met: 10 of 18
56. (increment c15)
   changed: (value c15) from 58 to 67
   goals met: 10 of 18
57. (increase_rate c15)
   changed: (rate_value c15) from 9 to 10
   goals met: 10 of 18
58. (increment c15)
   changed: (value c15) from 67 to 77
   goals met: 9 of 18
59. (increase_rate c10)
   changed: (rate_value c10) from 0 to 1
   goals met: 9 of 18
60. (increase_rate c10)
   changed: (rate_value c10) from 1 to 2
   goals met: 9 of 18
61. (increase_rate c10)
   changed: (rate_value c10) from 2 to 3
   goals met: 9 of 18
62. (increment c11)
   changed: (value c11) from 23 to 29
   goals met: 8 of 18
63. (increase_rate c10)
   changed: (rate_value c10) from 3 to 4
   goals met: 8 of 18
64. (increase_rate c10)
   changed: (rate_value c10) from 4 to 5
   goals met: 8 of 18
65. (decrement c11)
   changed: (value c11) from 29 to 23
   goals met: 9 of 18
66. (increase_rate c11)
   changed: (rate_value c11) from 6 to 7
   goals met: 9 of 18
67. (increase_rate c10)
   changed: (rate_value c10) from 5 to 6
   goals met: 9 of 18
68. (increment c10)
   changed: (value c10) from 61 to 67
   goals met: 9 of 18
69. (increase_rate c11)
   changed: (rate_value c11) from 7 to 8
   goals met: 9 of 18
70. (increase_rate c11)
   changed: (rate_value c11) from 8 to 9
   goals met: 9 of 18
71. (increment c10)
   changed: (value c10) from 67 to 73
   goals met: 10 of 18
72. (increase_rate c9)
   changed: (rate_value c9) from 0 to 1
   goals met: 10 of 18
73. (increase_rate c9)
   changed: (rate_value c9) from 1 to 2
   goals met: 10 of 18
74. (increase_rate c9)
   changed: (rate_value c9) from 2 to 3
   goals met: 10 of 18
75. (increase_rate c9)
   changed: (rate_value c9) from 3 to 4
   goals met: 10 of 18
76. (increase_rate c9)
   changed: (rate_value c9) from 4 to 5
   goals met: 10 of 18
77. (increase_rate c9)
   changed: (rate_value c9) from 5 to 6
   goals met: 10 of 18
78. (increment c9)
   changed: (value c9) from 72 to 78
   goals met: 9 of 18
79. (increment c9)
   changed: (value c9) from 78 to 84
   goals met: 9 of 18
80. (increment c9)
   changed: (value c9) from 84 to 90
   goals met: 9 of 18
81. (increment c9)
   changed: (value c9) from 90 to 96
   goals met: 9 of 18
82. (decrement c8)
   changed: (value c8) from 96 to 93
   goals met: 10 of 18
83. (increase_rate c7)
   changed: (rate_value c7) from 8 to 9
   goals met: 10 of 18
84. (increment c7)
   changed: (value c7) from 1 to 10
   goals met: 10 of 18
85. (increment c7)
   changed: (value c7) from 10 to 19
   goals met: 10 of 18
86. (increment c7)
   changed: (value c7) from 19 to 28
   goals met: 10 of 18
87. (increment c7)
   changed: (value c7) from 28 to 37
   goals met: 10 of 18
88. (increase_rate c7)
   changed: (rate_value c7) from 9 to 10
   goals met: 10 of 18
89. (increment c7)
   changed: (value c7) from 37 to 47
   goals met: 10 of 18
90. (increment c7)
   changed: (value c7) from 47 to 57
   goals met: 10 of 18
91. (increment c7)
   changed: (value c7) from 57 to 67
   goals met: 11 of 18
92. (decrement c9)
   changed: (value c9) from 96 to 90
   goals met: 10 of 18
93. (decrement c9)
   changed: (value c9) from 90 to 84
   goals met: 10 of 18
94. (increase_rate c9)
   changed: (rate_value c9) from 6 to 7
   goals met: 10 of 18
95. (increase_rate c10)
   changed: (rate_value c10) from 6 to 7
   goals met: 10 of 18
96. (increase_rate c10)
   changed: (rate_value c10) from 7 to 8
   goals met: 10 of 18
97. (decrement c10)
   changed: (value c10) from 73 to 65
   goals met: 10 of 18
98. (decrement c10)
   changed: (value c10) from 65 to 57
   goals met: 10 of 18
99. (increase_rate c11)
   changed: (rate_value c11) from 9 to 10
   goals met: 10 of 18
100. (increase_rate c10)
   changed: (rate_value c10) from 8 to 9
   goals met: 10 of 18
101. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 10 of 18
102. (increment c9)
   changed: (value c9) from 84 to 91
   goals met: 10 of 18
103. (decrement c8)
   changed: (value c8) from 93 to 90
   goals met: 11 of 18
104. (increase_rate c9)
   changed: (rate_value c9) from 7 to 8
   goals met: 11 of 18
105. (increase_rate c9)
   changed: (rate_value c9) from 8 to 9
   goals met: 11 of 18
106. (increase_rate c9)
   changed: (rate_value c9) from 9 to 10
   goals met: 11 of 18
107. (increase_rate c4)
   changed: (rate_value c4) from 0 to 1
   goals met: 11 of 18
108. (increase_rate c4)
   changed: (rate_value c4) from 1 to 2
   goals met: 11 of 18
109. (increase_rate c4)
   changed: (rate_value c4) from 2 to 3
   goals met: 11 of 18
110. (increase_rate c4)
   changed: (rate_value c4) from 3 to 4
   goals met: 11 of 18
111. (increase_rate c4)
   changed: (rate_value c4) from 4 to 5
   goals met: 11 of 18
112. (increase_rate c4)
   changed: (rate_value c4) from 5 to 6
   goals met: 11 of 18
113. (increase_rate c4)
   changed: (rate_value c4) from 6 to 7
   goals met: 11 of 18
114. (increment c4)
   changed: (value c4) from 2 to 9
   goals met: 10 of 18
115. (increment c4)
   changed: (value c4) from 9 to 16
   goals met: 10 of 18
116. (increment c4)
   changed: (value c4) from 16 to 23
   goals met: 10 of 18
117. (increase_rate c3)
   changed: (rate_value c3) from 0 to 1
   goals met: 10 of 18
118. (increase_rate c3)
   changed: (rate_value c3) from 1 to 2
   goals met: 10 of 18
119. (increase_rate c4)
   changed: (rate_value c4) from 7 to 8
   goals met: 10 of 18
120. (decrement c4)
   changed: (value c4) from 23 to 15
   goals met: 10 of 18
121. (increase_rate c4)
   changed: (rate_value c4) from 8 to 9
   goals met: 10 of 18
122. (increase_rate c4)
   changed: (rate_value c4) from 9 to 10
   goals met: 10 of 18
123. (increment c4)
   changed: (value c4) from 15 to 25
   goals met: 10 of 18
124. (increase_rate c5)
   changed: (rate_value c5) from 0 to 1
   goals met: 10 of 18
125. (increase_rate c5)
   changed: (rate_value c5) from 1 to 2
   goals met: 10 of 18
126. (increase_rate c5)
   changed: (rate_value c5) from 2 to 3
   goals met: 10 of 18
127. (increase_rate c5)
   changed: (rate_value c5) from 3 to 4
   goals met: 10 of 18
128. (increment c5)
   changed: (value c5) from 8 to 12
   goals met: 10 of 18
129. (increment c5)
   changed: (value c5) from 12 to 16
   goals met: 10 of 18
130. (increment c5)
   changed: (value c5) from 16 to 20
   goals met: 10 of 18
131. (increment c5)
   changed: (value c5) from 20 to 24
   goals met: 10 of 18
132. (increment c5)
   changed: (value c5) from 24 to 28
   goals met: 11 of 18
133. (increase_rate c3)
   changed: (rate_value c3) from 2 to 3
   goals met: 11 of 18
134. (increment c4)
   changed: (value c4) from 25 to 35
   goals met: 10 of 18
135. (decrement c3)
   changed: (value c3) from 49 to 46
   goals met: 10 of 18
136. (increment c5)
   changed: (value c5) from 28 to 32
   goals met: 10 of 18
137. (increment c5)
   changed: (value c5) from 32 to 36
   goals met: 11 of 18
138. (increment c4)
   changed: (value c4) from 35 to 45
   goals met: 10 of 18
139. (increment c5)
   changed: (value c5) from 36 to 40
   goals met: 10 of 18
140. (increment c5)
   changed: (value c5) from 40 to 44
   goals met: 10 of 18
141. (increment c5)
   changed: (value c5) from 44 to 48
   goals met: 11 of 18
142. (increment c4)
   changed: (value c4) from 45 to 55
   goals met: 11 of 18
143. (increment c5)
   changed: (value c5) from 48 to 52
   goals met: 11 of 18
144. (increment c5)
   changed: (value c5) from 52 to 56
   goals met: 12 of 18
145. (decrement c9)
   changed: (value c9) from 91 to 81
   goals met: 11 of 18
146. (decrement c9)
   changed: (value c9) from 81 to 71
   goals met: 11 of 18
147. (increase_rate c8)
   changed: (rate_value c8) from 3 to 4
   goals met: 11 of 18
148. (increase_rate c8)
   changed: (rate_value c8) from 4 to 5
   goals met: 11 of 18
149. (decrement c8)
   changed: (value c8) from 90 to 85
   goals met: 11 of 18
150. (decrement c8)
   changed: (value c8) from 85 to 80
   goals met: 11 of 18
151. (decrement c8)
   changed: (value c8) from 80 to 75
   goals met: 11 of 18
152. (decrement c8)
   changed: (value c8) from 75 to 70
   goals met: 12 of 18
153. (increment c17)
   changed: (value c17) from 66 to 76
   goals met: 13 of 18
154. (increase_rate c18)
   changed: (rate_value c18) from 0 to 1
   goals met: 13 of 18
155. (increase_rate c18)
   changed: (rate_value c18) from 1 to 2
   goals met: 13 of 18
156. (increase_rate c18)
   changed: (rate_value c18) from 2 to 3
   goals met: 13 of 18
157. (increase_rate c18)
   changed: (rate_value c18) from 3 to 4
   goals met: 13 of 18
158. (increase_rate c18)
   changed: (rate_value c18) from 4 to 5
   goals met: 13 of 18
159. (increment c18)
   changed: (value c18) from 57 to 62
   goals met: 13 of 18
160. (increment c18)
   changed: (value c18) from 62 to 67
   goals met: 13 of 18
161. (increment c18)
   changed: (value c18) from 67 to 72
   goals met: 13 of 18
162. (increment c18)
   changed: (value c18) from 72 to 77
   goals met: 14 of 18
163. (increment c15)
   changed: (value c15) from 77 to 87
   goals met: 15 of 18
164. (increase_rate c16)
   changed: (rate_value c16) from 0 to 1
   goals met: 15 of 18
165. (increase_rate c16)
   changed: (rate_value c16) from 1 to 2
   goals met: 15 of 18
166. (increase_rate c16)
   changed: (rate_value c16) from 2 to 3
   goals met: 15 of 18
167. (increment c16)
   changed: (value c16) from 75 to 78
   goals met: 14 of 18
168. (increment c17)
   changed: (value c17) from 76 to 86
   goals met: 14 of 18
169. (increment c18)
   changed: (value c18) from 77 to 82
   goals met: 14 of 18
170. (increment c18)
   changed: (value c18) from 82 to 87
   goals met: 15 of 18
171. (increment c16)
   changed: (value c16) from 78 to 81
   goals met: 15 of 18
172. (increment c16)
   changed: (value c16) from 81 to 84
   goals met: 15 of 18
173. (increment c16)
   changed: (value c16) from 84 to 87
   goals met: 14 of 18
174. (increment c17)
   changed: (value c17) from 86 to 96
   goals met: 14 of 18
175. (increment c18)
   changed: (value c18) from 87 to 92
   goals met: 14 of 18
176. (increment c18)
   changed: (value c18) from 92 to 97
   goals met: 15 of 18
177. (increment c16)
   changed: (value c16) from 87 to 90
   goals met: 16 of 18
178. (increment c11)
   changed: (value c11) from 23 to 33
   goals met: 15 of 18
179. (increment c12)
   changed: (value c12) from 25 to 28
   goals met: 15 of 18
180. (increment c12)
   changed: (value c12) from 28 to 31
   goals met: 15 of 18
181. (increment c12)
   changed: (value c12) from 31 to 34
   goals met: 15 of 18
182. (increment c10)
   changed: (value c10) from 57 to 67
   goals met: 15 of 18
183. (increment c10)
   changed: (value c10) from 67 to 77
   goals met: 16 of 18
184. (decrement_rate c10)
   changed: (rate_value c10) from 10 to 9
   goals met: 16 of 18
185. (decrement c10)
   changed: (value c10) from 77 to 68
   goals met: 15 of 18
186. (decrement c10)
   changed: (value c10) from 68 to 59
   goals met: 15 of 18
187. (decrement c10)
   changed: (value c10) from 59 to 50
   goals met: 15 of 18
188. (decrement c10)
   changed: (value c10) from 50 to 41
   goals met: 15 of 18
189. (decrement c10)
   changed: (value c10) from 41 to 32
   goals met: 16 of 18
190. (increase_rate c10)
   changed: (rate_value c10) from 9 to 10
   goals met: 16 of 18
191. (increment c10)
   changed: (value c10) from 32 to 42
   goals met: 15 of 18
192. (increment c11)
   changed: (value c11) from 33 to 43
   goals met: 15 of 18
193. (increment c12)
   changed: (value c12) from 34 to 37
   goals met: 15 of 18
194. (increase_rate c13)
   changed: (rate_value c13) from 0 to 1
   goals met: 15 of 18
195. (increment c13)
   changed: (value c13) from 34 to 35
   goals met: 15 of 18
196. (increment c10)
   changed: (value c10) from 42 to 52
   goals met: 14 of 18
197. (decrement c12)
   changed: (value c12) from 37 to 34
   goals met: 15 of 18
198. (increment c11)
   changed: (value c11) from 43 to 53
   goals met: 16 of 18
199. (increase_rate c12)
   changed: (rate_value c12) from 3 to 4
   goals met: 16 of 18
200. (increase_rate c12)
   changed: (rate_value c12) from 4 to 5
   goals met: 16 of 18
201. (increment c12)
   changed: (value c12) from 34 to 39
   goals met: 15 of 18
202. (increment c12)
   changed: (value c12) from 39 to 44
   goals met: 15 of 18
203. (increase_rate c13)
   changed: (rate_value c13) from 1 to 2
   goals met: 15 of 18
204. (increase_rate c13)
   changed: (rate_value c13) from 2 to 3
   goals met: 15 of 18
205. (increase_rate c13)
   changed: (rate_value c13) from 3 to 4
   goals met: 15 of 18
206. (increase_rate c13)
   changed: (rate_value c13) from 4 to 5
   goals met: 15 of 18
207. (increment c13)
   changed: (value c13) from 35 to 40
   goals met: 15 of 18
208. (increment c13)
   changed: (value c13) from 40 to 45
   goals met: 16 of 18
209. (increment c12)
   changed: (value c12) from 44 to 49
   goals met: 15 of 18
210. (increment c13)
   changed: (value c13) from 45 to 50
   goals met: 16 of 18
211. (increment c12)
   changed: (value c12) from 49 to 54
   goals met: 16 of 18
212. (increment c13)
   changed: (value c13) from 50 to 55
   goals met: 17 of 18
213. (increment c10)
   changed: (value c10) from 52 to 62
   goals met: 16 of 18
214. (increment c11)
   changed: (value c11) from 53 to 63
   goals met: 16 of 18
215. (increment c12)
   changed: (value c12) from 54 to 59
   goals met: 15 of 18
216. (increment c13)
   changed: (value c13) from 55 to 60
   goals met: 16 of 18
217. (increment c12)
   changed: (value c12) from 59 to 64
   goals met: 16 of 18
218. (increment c13)
   changed: (value c13) from 60 to 65
   goals met: 17 of 18
219. (increment c10)
   changed: (value c10) from 62 to 72
   goals met: 17 of 18
220. (increment c11)
   changed: (value c11) from 63 to 73
   goals met: 17 of 18
221. (increment c12)
   changed: (value c12) from 64 to 69
   goals met: 16 of 18
222. (increment c13)
   changed: (value c13) from 65 to 70
   goals met: 17 of 18
223. (increment c12)
   changed: (value c12) from 69 to 74
   goals met: 17 of 18
224. (increment c13)
   changed: (value c13) from 70 to 75
   goals met: 18 of 18
